In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
show databases;

 * mysql+pymysql://root:***@localhost
19 rows affected.

[('date time',),
 ('duplicates handling',),
 ('employees',),
 ('events',),
 ('functions',),
 ('information_schema',),
 ('joins',),
 ('joins interview',),
 ('mysql',),
 ('performance_schema',),
 ('sales',),
 ('set operations',),
 ('sql_projects',),
 ('students',),
 ('subqueries',),
 ('sys',),
 ('triggers',),
 ('window functions interview questuions',),
 ('window_functions',)]

In [6]:
%%sql
use `duplicates handling`;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [9]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('employees',), ('employees_dup',)]

In [10]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00'))]

In [12]:
%%sql
select *,
row_number() over(partition by employee_id,name,department,salary) as `rn`
from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00'), 1),
 (1, 'John', 'Sales', Decimal('50000.00'), 2),
 (2, 'Alice', 'HR', Decimal('60000.00'), 1),
 (2, 'Alice', 'HR', Decimal('60000.00'), 2),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 1),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 2),
 (4, 'Carol', 'IT', Decimal('70000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 2),
 (6, 'Emma', 'Sales', Decimal('52000.00'), 1)]

In [14]:
%%sql
with `duplicate_handling` as
(
select *,
row_number() over(partition by employee_id,name,department,salary) as `rn`
from employees
)
select * from `duplicate_handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00'), 1),
 (2, 'Alice', 'HR', Decimal('60000.00'), 1),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 1),
 (4, 'Carol', 'IT', Decimal('70000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 1),
 (6, 'Emma', 'Sales', Decimal('52000.00'), 1)]

In [21]:
%%sql
with `duplicate_handling` as
(
select *,
row_number() over(partition by employee_id,name,department,salary) as `rn`
from employees
)
select employee_id,name,department,salary 
from `duplicate_handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00'))]

In [17]:
%%sql
create table employees_dupe2
(
    employee_id int,
    name varchar(50),
    department varchar(50),
    salary decimal(10,2)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [19]:
%%sql
select * from employees_dupe2;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [22]:
%%sql
insert into employees_dupe2
with `duplicate_handling` as
(
select *,
row_number() over(partition by employee_id,name,department,salary) as `rn`
from employees
)
select employee_id,name,department,salary 
from `duplicate_handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [23]:
%%sql
select * from employees_dupe2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00'))]

In [7]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00'))]

In [9]:
%%sql
select *,
row_number() over(partition by employee_id, name, department,salary) `rn`
from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00'), 1),
 (1, 'John', 'Sales', Decimal('50000.00'), 2),
 (2, 'Alice', 'HR', Decimal('60000.00'), 1),
 (2, 'Alice', 'HR', Decimal('60000.00'), 2),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 1),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 2),
 (4, 'Carol', 'IT', Decimal('70000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 2),
 (6, 'Emma', 'Sales', Decimal('52000.00'), 1)]

In [10]:
%%sql
with `duplicate handling` as
(
select *,
row_number() over(partition by employee_id, name, department,salary) `rn`
from employees
)
select * from `duplicate handling`
where `rn` = 1;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00'), 1),
 (2, 'Alice', 'HR', Decimal('60000.00'), 1),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 1),
 (4, 'Carol', 'IT', Decimal('70000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 1),
 (6, 'Emma', 'Sales', Decimal('52000.00'), 1)]

In [11]:
%%sql
with `duplicate handling` as
(
select *,
row_number() over(partition by employee_id, name, department,salary) `rn`
from employees
)
select * from `duplicate handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00'), 1),
 (2, 'Alice', 'HR', Decimal('60000.00'), 1),
 (3, 'Bob', 'Sales', Decimal('55000.00'), 1),
 (4, 'Carol', 'IT', Decimal('70000.00'), 1),
 (5, 'Dave', 'HR', Decimal('65000.00'), 1),
 (6, 'Emma', 'Sales', Decimal('52000.00'), 1)]

In [14]:
%%sql
desc employees;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('employee_id', 'int', 'YES', '', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('department', 'varchar(50)', 'YES', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [13]:
%%sql
create table empoloyees_new(employee_id int ,
                            name varchar(50),
                            department varchar(50),
                            salary decimal(10,2));

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [16]:
%%sql
select * from empoloyees_new;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [18]:
%%sql
with `duplicate handling` as
(
select *,
row_number() over(partition by employee_id, name, department,salary) `rn`
from employees
)
select employee_id,name,department,salary 
from `duplicate handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00'))]

In [19]:
%%sql
insert into empoloyees_new
with `duplicate handling` as
(
select *,
row_number() over(partition by employee_id, name, department,salary) `rn`
from employees
)
select employee_id,name,department,salary 
from `duplicate handling`
where `rn` < 2;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [21]:
%%sql
select * from empoloyees_new;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00'))]

In [23]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (4, 'Carol', 'IT', Decimal('70000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00')),
 (1, 'John', 'Sales', Decimal('50000.00')),
 (2, 'Alice', 'HR', Decimal('60000.00')),
 (6, 'Emma', 'Sales', Decimal('52000.00')),
 (3, 'Bob', 'Sales', Decimal('55000.00')),
 (5, 'Dave', 'HR', Decimal('65000.00'))]